{"type":"data","nodes":[null,{"type":"data","data":[{"anime":1},{"_id":2,"title":3,"alternativeTitles":4,"ranking":10,"genres":11,"episodes":15,"hasEpisode":16,"hasRanking":16,"image":17,"link":18,"status":19,"synopsis":20,"thumb":21,"type":22},"15335","Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare",[5,6,7,8,9],"Gintama: The Final Chapter - Be Forever Yorozuya","Gintama Movie 2","劇場版 銀魂 完結篇 万事屋よ永遠なれ","Gintama: The Movie: The Final Chapter: Be Forever Yorozuya","Gintama the Movie 2",20,[12,13,14],"Action","Comedy","Sci-Fi",1,true,"https:\u002F\u002Fcdn.myanimelist.net\u002Fimages\u002Fanime\u002F10\u002F51723.jpg","https:\u002F\u002Fmyanimelist.net\u002Fanime\u002F15335\u002FGintama_Movie_2__Kanketsu-hen_-_Yorozuya_yo_Eien_Nare","Finished Airing","When Gintoki apprehends a movie pirate at a premiere, he checks the camera's footage and finds himself transported to a bleak, post-apocalyptic version of Edo, where a mysterious epidemic called the \"White Plague\" has ravished the world's population. It turns out that the movie pirate wasn't a pirate after all—it was an android time machine, and Gintoki has been hurtled five years into the future! Shinpachi and Kagura, his Yorozuya cohorts, have had a falling out and are now battle-hardened solo vigilantes and he himself has been missing for years, disappearing without a trace after scribbling a strange message in his journal.\n\nSetting out in the disguise given to him by the android time machine, Gintoki haphazardly reunites the Yorozuya team to investigate the White Plague, and soon discovers that the key to saving the future lies in the darkness of his own past. Determined to confront a powerful foe, he makes an important discovery—with a ragtag band of friends and allies at his side, he doesn't have to fight alone.\n\n[Written by MAL Rewrite]","https:\u002F\u002Fcdn.myanimelist.net\u002Fr\u002F50x70\u002Fimages\u002Fanime\u002F10\u002F51723.jpg?s=27cd24446486572fb64c42a689d38902","Movie"],"uses":{"params":["id"]}}]}
